# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [25]:
first=np.random.randint(1,4,100)
second=np.random.randint(1,3,100)
third=np.random.randint(10000,30000,100)

In [47]:
# 제공한 정답

first = pd.Series(np.random.randint(1,5,100))
second = pd.Series(np.random.randint(1,4,100))
third = pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [36]:
all = np.array([first, second, third]).reshape(-1,3)

In [37]:
df = pd.DataFrame(all)

In [49]:
# 제공한 정답

housemkt = pd.concat([first,second,third], axis=1)
housemkt

    0  1      2
0   2  3  27944
1   4  2  17431
2   4  1  20528
3   2  3  28519
4   3  2  22412
.. .. ..    ...
95  4  3  21896
96  4  3  20468
97  2  2  14120
98  4  1  14607
99  3  2  18751

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [39]:
df.columns = ['bedrs','bathrs','price_sqr_meter']

In [52]:
# 제공한 정답

housemkt.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'}, inplace=True)
housemkt[:3]

                 bedrs  bathrs  price_sqr_meter
bedrs                2       3            27944
bathrs               4       2            17431
price_sqr_meter      4       1            20528

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [43]:
allinone = pd.DataFrame(np.concatenate([first,second,third]))

In [61]:
bigcolumn = pd.concat([first,second,third], axis=0)
print(type(bigcolumn))
bigcolumn=bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn[-3:]

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

        0
97  14120
98  14607
99  18751

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [63]:
print(len(bigcolumn))
bigcolumn.index

300

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [64]:
# 제공 답안

bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        4
2        4
3        2
4        3
..     ...
295  21896
296  20468
297  14120
298  14607
299  18751

[300 rows x 1 columns]